; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
;; passengers=10, floors=20, out_folder=training/easy, instance_id=97, seed=124

(define (problem miconic-97)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 f13 f14 f15 f16 f17 f18 f19 f20 - floor
    )
 (:init 
    (lift-at f9)
    (origin p1 f18)
    (destin p1 f1)
    (origin p2 f6)
    (destin p2 f2)
    (origin p3 f14)
    (destin p3 f9)
    (origin p4 f12)
    (destin p4 f2)
    (origin p5 f11)
    (destin p5 f6)
    (origin p6 f13)
    (destin p6 f10)
    (origin p7 f14)
    (destin p7 f1)
    (origin p8 f18)
    (destin p8 f16)
    (origin p9 f20)
    (destin p9 f14)
    (origin p10 f1)
    (destin p10 f9)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f1 f12)
    (above f1 f13)
    (above f1 f14)
    (above f1 f15)
    (above f1 f16)
    (above f1 f17)
    (above f1 f18)
    (above f1 f19)
    (above f1 f20)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f2 f12)
    (above f2 f13)
    (above f2 f14)
    (above f2 f15)
    (above f2 f16)
    (above f2 f17)
    (above f2 f18)
    (above f2 f19)
    (above f2 f20)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f3 f12)
    (above f3 f13)
    (above f3 f14)
    (above f3 f15)
    (above f3 f16)
    (above f3 f17)
    (above f3 f18)
    (above f3 f19)
    (above f3 f20)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f4 f12)
    (above f4 f13)
    (above f4 f14)
    (above f4 f15)
    (above f4 f16)
    (above f4 f17)
    (above f4 f18)
    (above f4 f19)
    (above f4 f20)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f5 f12)
    (above f5 f13)
    (above f5 f14)
    (above f5 f15)
    (above f5 f16)
    (above f5 f17)
    (above f5 f18)
    (above f5 f19)
    (above f5 f20)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f6 f12)
    (above f6 f13)
    (above f6 f14)
    (above f6 f15)
    (above f6 f16)
    (above f6 f17)
    (above f6 f18)
    (above f6 f19)
    (above f6 f20)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f7 f12)
    (above f7 f13)
    (above f7 f14)
    (above f7 f15)
    (above f7 f16)
    (above f7 f17)
    (above f7 f18)
    (above f7 f19)
    (above f7 f20)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f8 f12)
    (above f8 f13)
    (above f8 f14)
    (above f8 f15)
    (above f8 f16)
    (above f8 f17)
    (above f8 f18)
    (above f8 f19)
    (above f8 f20)
    (above f9 f10)
    (above f9 f11)
    (above f9 f12)
    (above f9 f13)
    (above f9 f14)
    (above f9 f15)
    (above f9 f16)
    (above f9 f17)
    (above f9 f18)
    (above f9 f19)
    (above f9 f20)
    (above f10 f11)
    (above f10 f12)
    (above f10 f13)
    (above f10 f14)
    (above f10 f15)
    (above f10 f16)
    (above f10 f17)
    (above f10 f18)
    (above f10 f19)
    (above f10 f20)
    (above f11 f12)
    (above f11 f13)
    (above f11 f14)
    (above f11 f15)
    (above f11 f16)
    (above f11 f17)
    (above f11 f18)
    (above f11 f19)
    (above f11 f20)
    (above f12 f13)
    (above f12 f14)
    (above f12 f15)
    (above f12 f16)
    (above f12 f17)
    (above f12 f18)
    (above f12 f19)
    (above f12 f20)
    (above f13 f14)
    (above f13 f15)
    (above f13 f16)
    (above f13 f17)
    (above f13 f18)
    (above f13 f19)
    (above f13 f20)
    (above f14 f15)
    (above f14 f16)
    (above f14 f17)
    (above f14 f18)
    (above f14 f19)
    (above f14 f20)
    (above f15 f16)
    (above f15 f17)
    (above f15 f18)
    (above f15 f19)
    (above f15 f20)
    (above f16 f17)
    (above f16 f18)
    (above f16 f19)
    (above f16 f20)
    (above f17 f18)
    (above f17 f19)
    (above f17 f20)
    (above f18 f19)
    (above f18 f20)
    (above f19 f20)
)
 (:goal  (and (served p1)
   (served p2)
   (served p3)
   (served p4)
   (served p5)
   (served p6)
   (served p7)
   (served p8)
   (served p9)
   (served p10))))

; plan
1. (up f9 f11)
   deleted: (lift-at f9)
   added: (lift-at f11)
   goals met: 0 of 10
2. (board f11 p5)
   deleted: (origin p5 f11)
   added: (boarded p5)
   goals met: 0 of 10
3. (down f11 f6)
   deleted: (lift-at f11)
   added: (lift-at f6)
   goals met: 0 of 10
4. (board f6 p2)
   deleted: (origin p2 f6)
   added: (boarded p2)
   goals met: 0 of 10
5. (depart f6 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 1 of 10
6. (up f6 f12)
   deleted: (lift-at f6)
   added: (lift-at f12)
   goals met: 1 of 10
7. (board f12 p4)
   deleted: (origin p4 f12)
   added: (boarded p4)
   goals met: 1 of 10
8. (down f12 f2)
   deleted: (lift-at f12)
   added: (lift-at f2)
   goals met: 1 of 10
9. (depart f2 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 2 of 10
10. (depart f2 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 3 of 10
11. (up f2 f13)
   deleted: (lift-at f2)
   added: (lift-at f13)
   goals met: 3 of 10
12. (board f13 p6)
   deleted: (origin p6 f13)
   added: (boarded p6)
   goals met: 3 of 10
13. (down f13 f10)
   deleted: (lift-at f13)
   added: (lift-at f10)
   goals met: 3 of 10
14. (depart f10 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 4 of 10
15. (up f10 f18)
   deleted: (lift-at f10)
   added: (lift-at f18)
   goals met: 4 of 10
16. (board f18 p1)
   deleted: (origin p1 f18)
   added: (boarded p1)
   goals met: 4 of 10
17. (board f18 p8)
   deleted: (origin p8 f18)
   added: (boarded p8)
   goals met: 4 of 10
18. (down f18 f16)
   deleted: (lift-at f18)
   added: (lift-at f16)
   goals met: 4 of 10
19. (depart f16 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 5 of 10
20. (up f16 f20)
   deleted: (lift-at f16)
   added: (lift-at f20)
   goals met: 5 of 10
21. (board f20 p9)
   deleted: (origin p9 f20)
   added: (boarded p9)
   goals met: 5 of 10
22. (down f20 f14)
   deleted: (lift-at f20)
   added: (lift-at f14)
   goals met: 5 of 10
23. (board f14 p3)
   deleted: (origin p3 f14)
   added: (boarded p3)
   goals met: 5 of 10
24. (board f14 p7)
   deleted: (origin p7 f14)
   added: (boarded p7)
   goals met: 5 of 10
25. (depart f14 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 6 of 10
26. (down f14 f1)
   deleted: (lift-at f14)
   added: (lift-at f1)
   goals met: 6 of 10
27. (depart f1 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 7 of 10
28. (board f1 p10)
   deleted: (origin p10 f1)
   added: (boarded p10)
   goals met: 7 of 10
29. (depart f1 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 8 of 10
30. (up f1 f9)
   deleted: (lift-at f1)
   added: (lift-at f9)
   goals met: 8 of 10
31. (depart f9 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 9 of 10
32. (depart f9 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 10 of 10
